# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

### Step 3. Let's create a DataFrame by joinning the Series by column

In [32]:
first = pd.Series(np.random.randint(1, 4, size=100, dtype='l'))
second = pd.Series(np.random.randint(1, 3, size=100, dtype='l'))
third = pd.Series(np.random.randint(10000, 30000, size=100, dtype='l'))

In [35]:
data = pd.concat([first, second, third], axis=1)
data.head()

   0  1      2
0  1  1  16285
1  3  1  12876
2  2  1  12957
3  3  2  24533
4  2  2  16607

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [36]:
data = data.rename(columns={0:'bedrs', 1:'bathrs', 2:'price_sqr_meter'})
data.head()

   bedrs  bathrs  price_sqr_meter
0      1       1            16285
1      3       1            12876
2      2       1            12957
3      3       2            24533
4      2       2            16607

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [43]:
data2 = pd.concat([first, second, third], axis=0)
bigcolumn = pd.DataFrame(data2)
bigcolumn

        0
0       1
1       3
2       2
3       3
4       2
..    ...
95  16092
96  26375
97  22574
98  23795
99  20038

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [44]:
bigcolumn.reset_index(drop=True)

         0
0        1
1        3
2        2
3        3
4        2
..     ...
295  16092
296  26375
297  22574
298  23795
299  20038

[300 rows x 1 columns]

### Step 7. Reindex the DataFrame so it goes from 0 to 299